index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc02bfd">Welcome</a></li>
<li><a href="#org199d40a">Project Organization</a></li>
<li><a href="#org8d83a83">Step 1: Create Binary Files using</a></li>
<li><a href="#org950b450">Step 2: Create the input settings (.in) file</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./inigenerator.html">inigenerator</a></td>
</tr>
</tbody>
</table>
<div id="outline-container-orgcc02bfd" class="outline-2">
<h2 id="orgcc02bfd">Welcome</h2>
<div class="outline-text-2" id="text-orgcc02bfd">
<p>
Welcome to the flowVC-utils documentation this utility project provides documentation and tooling to assist in utilizing the flowVC software for computing Finite Time Lyoponove Exponents
</p>
</div>
</div>

<div id="outline-container-org199d40a" class="outline-2">
<h2 id="org199d40a">Project Organization</h2>
<div class="outline-text-2" id="text-org199d40a">
<p>
It is recomended that before starting your project is organized into the following directory structure, with a subdirectory being created for each of the simulation cases. Note the trailing "_" in the subdirectory names, this is necissary for the code to to generate and identify file names throughout the process.
</p>

<p>
└── project_root
    ├── case1_
    │   ├── input_bin
    │   ├── input_vtu
    │   │   ├── case1_00000.vtu
    │   │   ├── case1_00050.vtu
    │   │   └── case2_00100.vtu
    │   ├── output_bin
    │   └── output_vtk
    └── case2_
        ├── input_bin
        ├── input_vtu
        │   ├── case2_00000.vtu
        │   ├── case2_00050.vtu
        │   └── case2_00100.vtu
        ├── output_bin
        └── output_vtk
</p>

<p>
The input_vtu stores the input data files in a ".vtu" file format. This would often be the velocity data from a CFD simulation that you wish to generate FTLE fields for.
</p>
</div>
</div>

<div id="outline-container-org8d83a83" class="outline-2">
<h2 id="org8d83a83">Step 1: Create Binary Files using</h2>
<div class="outline-text-2" id="text-org8d83a83">
<p>
FlowVC requires the velocity data be converted into binary files prior to exectution. These binary files contain the velocity data as well as the coordinate and connectivity information of your dataset. For more information regarding the anticipated file format, refer to the flowVC documentation <a href="https://bkm82.github.io/flowVC/">flowVC Documenation</a>.
</p>

<p>
To generate the binary files use the vtu2bin argument <a href="./vtu_2bin.html">vtu2bin</a>
</p>
</div>
</div>



<div id="outline-container-org950b450" class="outline-2">
<h2 id="org950b450">Step 2: Create the input settings (.in) file</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
